Tekla.Structures.ModelInternal.BimModelDataProduct.BimModelDataProductClient
Client for interacting with the BimModelDataProduct API to manage BIM models.

Tekla.Structures.ModelInternal.BimModelDataProduct.BimModelDataProductClient.#ctor(DotNetKit.Env.AtcEnvironment,Microsoft.Extensions.Logging.ILogger,System.Net.Http.HttpClient,System.Net.Http.HttpClient,System.Action{System.Net.Http.HttpRequestMessage})
Initializes a new instance of the Tekla.Structures.ModelInternal.BimModelDataProduct.BimModelDataProductClient class with the specified deployment environment.
environment: The deployment environment
logger: Logger instance for logging messages.
httpClient: Optional. The httpClient to be used to make http requests.
fileOperationHttpClient: Optional. The httpClient to be used to upload files.
reportContextSetter: Optional. Action to set report context headers.

Tekla.Structures.ModelInternal.BimModelDataProduct.BimModelDataProductClient.#ctor(Microsoft.Extensions.Logging.ILogger,System.Net.Http.HttpClient,System.Net.Http.HttpClient,System.Action{System.Net.Http.HttpRequestMessage})
Initializes a new instance of the Tekla.Structures.ModelInternal.BimModelDataProduct.BimModelDataProductClient class with the specified deployment environment.
logger: Logger instance for logging messages.
httpClient: Optional. The httpClient to be used to make http requests.
fileOperationHttpClient: Optional. The httpClient to be used to upload files.
reportContextSetter: Optional. Action to set report context headers.

Tekla.Structures.ModelInternal.BimModelDataProduct.BimModelDataProductClient.CheckApiCompatibilityAsync(System.String,System.Threading.CancellationToken)
Checks the compatibility of a specified TS product version with the BIM Model Data Product API.
TsProductVersion: The Tekla Structures product version to check for compatibility.
cancellationToken: A token to monitor for cancellation requests. Optional.
Returns:
A Tekla.Structures.ModelInternal.BimModelDataProduct.CompatibilityCheckResult indicating the compatibility status.
If the status is Tekla.Structures.ModelInternal.BimModelDataProduct.CompatibilityStatus.Success, the version is compatible.
Otherwise, the user should be warned with information in Tekla.Structures.ModelInternal.BimModelDataProduct.CompatibilityCheckResult.Metadata.
Remarks:
Caller should not make further API calls if result status is Tekla.Structures.ModelInternal.BimModelDataProduct.CompatibilityStatus.UpgradeRequired, as response will be 426 Upgrade Required.
When result status is not Tekla.Structures.ModelInternal.BimModelDataProduct.CompatibilityStatus.UpgradeRequired, caller will receive API response as normal, but some features may not be available or fully supported.
Throws System.Net.Http.HttpRequestException: Exception occurred when getting and parsing data product metadata.
Throws System.InvalidOperationException: Exception occurred when failed to extracting BIM Model Data Product metadata from data product metadata.

Tekla.Structures.ModelInternal.BimModelDataProduct.BimModelDataProductClient.CreateModelAsync(System.String,Tekla.Structures.ModelInternal.BimModelDataProduct.Types.BimModelDataApiRegion,Tekla.Structures.ModelInternal.BimModelDataProduct.DTO.CreateModelRequest,System.IO.Stream,System.Threading.CancellationToken,System.IProgress{System.Int64})
Creates a new model in the Bim Model Data Product and uploads a file as its first version.
Model creation will remain in a pending state until the file upload is completed successfully.
accessToken: Trimble access token used for authentication.
region: Region of data storage to connect.
createModelRequest: The information required for model creation.
stream: The stream containing the file data to be uploaded.
cancellationToken: Optional.
progress: Optional. Progress reporter for upload.
Returns:
The created model ID if creation and upload are successful; otherwise, null.
Throws System.Net.Http.HttpRequestException: Exception occurred when creating the cloud model.

Tekla.Structures.ModelInternal.BimModelDataProduct.BimModelDataProductClient.GetModelsAsync(System.String,Tekla.Structures.ModelInternal.BimModelDataProduct.Types.BimModelDataApiRegion,Tekla.Structures.ModelInternal.BimModelDataProduct.ListModelOptions,System.Threading.CancellationToken)
Asynchronously retrieves BIM models from the Bim Model Data Product service.
accessToken: The Trimble access token used for authentication.
region: Region of data storage to connect.
options: Options for filtering the list of models.
cancellationToken: Optional.
Returns:
An array of ICloudModelInfo instances representing each model.
Throws System.Net.Http.HttpRequestException: Exception occurred when fetching the available cloud models.

Tekla.Structures.ModelInternal.BimModelDataProduct.BimModelDataProductClient.CreateModelVersionAsync(System.String,Tekla.Structures.ModelInternal.BimModelDataProduct.ICloudModelInfo,Tekla.Structures.ModelInternal.BimModelDataProduct.ModelVersionInit,System.IO.Stream,System.Threading.CancellationToken,System.IProgress{System.Int64})
Creates a new version for an existing model.
accessToken: The Trimble access token used for authentication.
cloudModelInfo: The cloud model information for which to create versions. Must be of type Tekla.Structures.ModelInternal.BimModelDataProduct.CloudModelInfo.
modelVersionInit: The model version creation information
stream: The stream containing the file data to be uploaded.
cancellationToken: Optional http request cancellation token.
progress: Optional. Progress reporter for upload.
Returns:
A Tekla.Structures.ModelInternal.BimModelDataProduct.ICloudModelVersionInfo containing the details of the created model version if successful; otherwise, null if the operation fails.
Throws System.NotSupportedException:
Thrown if the provided cloudModelInfo is not of type Tekla.Structures.ModelInternal.BimModelDataProduct.CloudModelVersionInfo.
Throws System.ArgumentException: Provided arguments are not valid
Throws System.Net.Http.HttpRequestException: Exception occurred when creating the model version.

Tekla.Structures.ModelInternal.BimModelDataProduct.BimModelDataProductClient.GetModelVersionsAsync(System.String,Tekla.Structures.ModelInternal.BimModelDataProduct.ICloudModelInfo,System.Boolean,System.Threading.CancellationToken)
Asynchronously retrieves all versions of a given BIM model from the Bim Model Data Product service.
accessToken: The Trimble access token used for authentication.
cloudModelInfo: The cloud model information from which to retrieve versions. Must be of type Tekla.Structures.ModelInternal.BimModelDataProduct.CloudModelInfo.
getAllVersions: If set to true, retrieves all versions of the model; otherwise, retrieves only versions from the mainline version history.
!!IMPORTANT - WARNING!!
The default value may change from true to false once the changeDiff functionality is implemented in the cloud and/or UI
decisions for display is done.
cancellationToken: Optional.
Returns:
An array of Tekla.Structures.ModelInternal.BimModelDataProduct.ICloudModelVersionInfo instances, each representing a version of the specified model.
Throws System.NotSupportedException:
Thrown if the provided cloudModelInfo is not of type Tekla.Structures.ModelInternal.BimModelDataProduct.CloudModelInfo.
Throws System.ArgumentException: Provided arguments are not valid
Exception occurred when fetching the model version.

Tekla.Structures.ModelInternal.BimModelDataProduct.BimModelDataProductClient.GetModelVersionAsync(System.String,Tekla.Structures.ModelInternal.BimModelDataProduct.ICloudModelVersionInfo,System.Threading.CancellationToken)
Asynchronously retrieves a specific version of a BIM model from the Bim Model Data Product service.
accessToken: The Trimble access token used for authentication.
cloudModelVersionInfo: The cloud model information for which to upload the file. Must be of type Tekla.Structures.ModelInternal.BimModelDataProduct.CloudModelVersionInfo.
cancellationToken: Optional cancellation token.
Returns: An Tekla.Structures.ModelInternal.BimModelDataProduct.ICloudModelVersionInfo object representing the retrieved version if successful; otherwise, null.
Throws System.NotSupportedException: Thrown when cloudModelVersionInfo is not of type Tekla.Structures.ModelInternal.BimModelDataProduct.CloudModelVersionInfo.
Throws System.ArgumentException: Provided arguments are not valid
Throws System.Net.Http.HttpRequestException: Exception occurred when fetching the model version.

Tekla.Structures.ModelInternal.BimModelDataProduct.BimModelDataProductClient.UploadModelVersionFormat(System.String,Tekla.Structures.ModelInternal.BimModelDataProduct.ICloudModelVersionInfo,System.String,System.IO.Stream,System.Threading.CancellationToken,System.IProgress{System.Int64})
Uploads a file in a specific format for an existing model version.
accessToken: The Trimble access token used for authentication.
cloudModelVersionInfo: The cloud model information for which to upload the file. Must be of type Tekla.Structures.ModelInternal.BimModelDataProduct.CloudModelVersionInfo.
uploadFormat: The format in which the file should be uploaded (e.g., "seb", "trb").
stream: The stream containing the file data to be uploaded.
cancellationToken: Optional cancellation token.
progress: Optional. Progress reporter for upload.
Returns:  true if the upload is successful; otherwise, false.
Throws System.NotSupportedException: Thrown when cloudModelVersionInfo is not of type Tekla.Structures.ModelInternal.BimModelDataProduct.CloudModelVersionInfo
Throws System.ArgumentException: Provided arguments are not valid
Throws System.Net.Http.HttpRequestException: Exception occurred when uploading the model version.

Tekla.Structures.ModelInternal.BimModelDataProduct.BimModelDataProductClient.UpdateModelAsync(System.String,Tekla.Structures.ModelInternal.BimModelDataProduct.ICloudModelInfo,Tekla.Structures.ModelInternal.BimModelDataProduct.ModelUpdate,System.Threading.CancellationToken)
Asynchronously updates a BIM model in the Bim Model Data Product.
accessToken: The Trimble access token used for authentication.
cloudModelInfo: The cloud model information for which we want to update their information. Must be of type Tekla.Structures.ModelInternal.BimModelDataProduct.CloudModelInfo.
modelUpdate: The content of the update.
cancellationToken: Optional http request cancellation token.
Returns: An Tekla.Structures.ModelInternal.BimModelDataProduct.ICloudModelInfo object representing the updated model if the update is successful; otherwise, null.
Throws System.NotSupportedException: Thrown when cloudModelInfo is not of type Tekla.Structures.ModelInternal.BimModelDataProduct.CloudModelVersionInfo
Throws System.ArgumentException: Thrown when modelId is null or empty.
Throws System.Net.Http.HttpRequestException: Exception occurred when uploading the model version.

Tekla.Structures.ModelInternal.BimModelDataProduct.BimModelDataProductClient.DeleteModelAsync(System.String,Tekla.Structures.ModelInternal.BimModelDataProduct.ICloudModelInfo,System.Boolean,System.Threading.CancellationToken)
Asynchronously deletes a BIM model from the Bim Model Data Product.
accessToken: The Trimble access token used for authentication.
cloudModelInfo: The model information for the model to delete. Must be of type Tekla.Structures.ModelInternal.BimModelDataProduct.CloudModelInfo.
immediate:
If true, the model is deleted immediately. If false, the model is marked for deletion and may be deleted later.
cancellationToken: Optional.
Returns: true if the delete operation is successful, otherwise false.
Throws System.NotSupportedException: Thrown when cloudModelInfo is not of type Tekla.Structures.ModelInternal.BimModelDataProduct.CloudModelInfo
Throws System.ArgumentException: Thrown when modelId is null or empty.
Throws System.Net.Http.HttpRequestException: Exception occurred when deleting the model.

Tekla.Structures.ModelInternal.BimModelDataProduct.BimModelDataProductClient.GetModelAccessAsync(System.String,Tekla.Structures.ModelInternal.BimModelDataProduct.ICloudModelInfo,System.Threading.CancellationToken)
Asynchronously retrieves the access control list for a specific BIM model.
accessToken: The Trimble access token used for authentication.
cloudModelInfo: The model information for the model. Must be of type Tekla.Structures.ModelInternal.BimModelDataProduct.CloudModelInfo.
cancellationToken: Optional cancellation token.
Returns:
An arrays of Tekla.Structures.ModelInternal.BimModelDataProduct.AccessControlListEntry representing a page of the access control list entries for the specified model.
Throws System.NotSupportedException: Thrown when cloudModelInfo is not of type Tekla.Structures.ModelInternal.BimModelDataProduct.CloudModelInfo
Throws System.ArgumentException: Thrown when modelId is null or empty.
Throws System.Net.Http.HttpRequestException: Exception occurred when getting the given model permissions.

Tekla.Structures.ModelInternal.BimModelDataProduct.BimModelDataProductClient.AddOrUpdateModelAccessAsync(System.String,Tekla.Structures.ModelInternal.BimModelDataProduct.ICloudModelInfo,Tekla.Structures.ModelInternal.BimModelDataProduct.AccessControlListEntry[],System.Threading.CancellationToken)
Asynchronously adds or updates access for a specific principal to a BIM model in the Bim Model Data Product.
accessToken: The Trimble access token used for authentication.
cloudModelInfo: The model information for the model. Must be of type Tekla.Structures.ModelInternal.BimModelDataProduct.CloudModelInfo.
accessControlListEntries: The access control entries specifying the principal and access level to add or update.
cancellationToken: Optional cancellation token.
Returns: true if the add or update access operation is successful, otherwise false.
Throws System.NotSupportedException: Thrown when cloudModelInfo is not of type Tekla.Structures.ModelInternal.BimModelDataProduct.CloudModelInfo
Throws System.ArgumentException: Thrown when modelId is null or empty.
Throws System.Net.Http.HttpRequestException: Exception occurred when updating the given model permissions.

Tekla.Structures.ModelInternal.BimModelDataProduct.BimModelDataProductClient.RemoveModelAccessAsync(System.String,Tekla.Structures.ModelInternal.BimModelDataProduct.ICloudModelInfo,System.String[],System.Threading.CancellationToken)
Asynchronously removes access for a specific principal from a BIM model in the Bim Model Data Product.
accessToken: The Trimble access token used for authentication.
cloudModelInfo: The model information for the model. Must be of type Tekla.Structures.ModelInternal.BimModelDataProduct.CloudModelInfo.
principalIds: The principal identifiers whose access are to be removed.
cancellationToken: Optional cancellation token.
Returns: true if the remove access operation is successful, otherwise false.
Throws System.NotSupportedException: Thrown when cloudModelInfo is not of type Tekla.Structures.ModelInternal.BimModelDataProduct.CloudModelInfo
Throws System.ArgumentException: Thrown when modelId is null or empty.
Throws System.Net.Http.HttpRequestException: Exception occurred when removing the given model permissions.